interface whatWeDoDataType {
    title: string;
    description: string;
}

// data.ts
export const whatWeDoData: whatWeDoDataType[] = [
    {
        title: 'Три одностраничных сайта:',
        description:
            'Вы создадите три простых сайта, что позволит вам освоить основы HTML, CSS и JavaScript.',
    },
    {
        title: 'Загрузка проекта на хостинг:',
        description: 'Научимся загружать сайты на хостинг.',
    },
    {
        title: 'Приложение «Прогноз погоды»:',
        description:
            'Вы создадите интерактивное приложение, которое будет отображать прогноз погоды, используя API, что поможет вам научиться работать с внешними данными и динамически обновлять контент.',
    },
    {
        title: 'Многостраничный сайт:',
        description:
            'Вы разработаете полноценный многостраничный сайт с функционалом отправки форм на почту с помощью PHP, что даст вам опыт работы с серверной частью.',
    },
];
